Задания на 1 балл
1. Своими словами дать определение термину "переменная".
2. Перечислите базовые типы данных в Python.
3. Выберите лишнюю операцию: 1. / 2. // 3. % 4. **
4. Выберите операцию, которая обозначает поиск остатка от деления: 1. ! 2. // 3. % 4. =
5. Для чего нужна функция print()?
6. Для чего нужна функция input()?
7. Какой функции не существует? 1. type() 2. int() 3. bool() 4. write()
8. Какие ключевые слова существуют для условного оператора?
9. Какое значение недопустимо для переменной типа bool? 1. True 2. False 3. 1 4. "hello"
10. Какие вы знаете логические операции?
Задания на 2 балла
11. Написать программу, которая принимает на вход 2 числа и выводит большее из них.
12. Написать программу, которая принимает на вход число и выводит "True", если 
оно делится на 5 без остатка и при этом больше 10.
13. Написать программу, которая принимает на вход число и выводит "True", если 
оно положительное или делится на 2 без остатка.
14. Написать программу, которая принимает на вход строку и выводит количество букв в этой строке.
15. Написать программу, которая принимает на вход две строки и выводит сообщение вида: "str1 != str2"
	Если ввели слова "hello" и "world", должно получиться "hello != world"
Критерии оценивания:
16-20 баллов -> отлично
12-15 баллов -> хорошо
8 - 11 баллов -> удовлетворительно
7 и меньше -> неудовлетворительно
11 - Все
12 - Все, кроме Жеребцова
13 - Поправко, Бондаренко, Андросов, Лысенко, Акишина, Назарьев
14 - Бондаренко, Поправко, Лысенко, Акишина, Андросов, Сорокин
15 - Бондаренко, Поправко, Лысенко
* -> минус балл за списывание
Акишина * 5 (17)
Андросов 5 (18)
Ахмадов 4 (14)
Бондаренко 5 (20)
Вялых 4 (12)
Гостев 4 (14)
Жеребцов 4 (12)
Лысенко 5 (20)
Назарьев * 4 (15)
Поправко 5 (20)
Сорокин * 5 (17)