##################################################
# 1. Написать программу, которая создает пустой  #
# список и добавляет туда 5 имен. Затем выводит  #
# список на экран                                #
# 2. Напишите программу, которая создает список  # 
# чисел от 1 до 10, а затем удаляет из списка все#
# нечетные числа                                 #
# 3. Напишите программу, которая запрашивает у   #
# пользователя 5 чисел и сохраняет их в список.  #
# 4. Напишите программу, которая создает список, #
# а затем выводит наибольший элемент списка.     #
# 5. Напишите программу, которая создает список, #
# а затем выводит наименьший элемент списка.     #
# 6. Напишите программу, которая находит сумму   #
# всех элементов списка                          #
##################################################
